In [2]:
import pandas as pd

In [3]:
data= pd.read_csv("Card_defaulter.csv")

In [4]:
data

      Unnamed: 0 default student      balance       income
0              0      No      No   729.526495  44361.62507
1              1      No     Yes   817.180407  12106.13470
2              2      No      No  1073.549164  31767.13895
3              3      No      No   529.250605  35704.49394
4              4      No      No   785.655883  38463.49588
...          ...     ...     ...          ...          ...
9995        9995      No      No   711.555020  52992.37891
9996        9996      No      No   757.962918  19660.72177
9997        9997      No      No   845.411989  58636.15698
9998        9998      No      No  1569.009053  36669.11236
9999        9999      No     Yes   200.922183  16862.95232

[10000 rows x 5 columns]

In [5]:
data= data.drop("Unnamed: 0", axis=1)

In [6]:
data.head()

  default student      balance       income
0      No      No   729.526495  44361.62507
1      No     Yes   817.180407  12106.13470
2      No      No  1073.549164  31767.13895
3      No      No   529.250605  35704.49394
4      No      No   785.655883  38463.49588

In [106]:
data["default"].value_counts()

No     9667
Yes     333
Name: default, dtype: int64

# lets do the LabelEncoder

In [107]:
 from sklearn.preprocessing import LabelEncoder

In [108]:
k= LabelEncoder()

In [109]:
data["default"]= k.fit_transform(data["default"])           # labelEncoder for ["default"] column

In [110]:
data.head()

   default student      balance       income
0        0      No   729.526495  44361.62507
1        0     Yes   817.180407  12106.13470
2        0      No  1073.549164  31767.13895
3        0      No   529.250605  35704.49394
4        0      No   785.655883  38463.49588

In [111]:
data["default"].value_counts()                  # inbalanced DATA , WE Have to do DATA Sampling   or sensitive Learning

0    9667
1     333
Name: default, dtype: int64

In [112]:
data["student"]= k.fit_transform(data["student"])          #  LabelEncoder for ["student"]  column

In [113]:
data.head()

   default  student      balance       income
0        0        0   729.526495  44361.62507
1        0        1   817.180407  12106.13470
2        0        0  1073.549164  31767.13895
3        0        0   529.250605  35704.49394
4        0        0   785.655883  38463.49588

In [114]:
data["student"].value_counts()

0    7056
1    2944
Name: student, dtype: int64

# now let's try to make Model

In [115]:
y= data["default"]       # target

In [116]:
y.head()

0    0
1    0
2    0
3    0
4    0
Name: default, dtype: int32

In [117]:
x= data.drop(["default"], axis= 1)        # features

In [118]:
x.head()

   student      balance       income
0        0   729.526495  44361.62507
1        1   817.180407  12106.13470
2        0  1073.549164  31767.13895
3        0   529.250605  35704.49394
4        0   785.655883  38463.49588

# now we have to use train_test_split

In [134]:
from sklearn.model_selection import train_test_split

In [135]:
x_train, x_test, y_train, y_test = train_test_split(x,y, test_size= 1/3, random_state= 0)

In [136]:
x_train.shape

(6666, 3)

In [137]:
x_test.shape

(3334, 3)

# now, we use naive_bayes

In [173]:
from sklearn.naive_bayes import GaussianNB

In [174]:
gnb= GaussianNB()

In [175]:
gnb.fit(x_train, y_train)

GaussianNB()

# let's check the score

In [182]:
gnb.score(x_train,y_train)

0.9708970897089709

In [183]:
gnb.score(x_test, y_test)

0.968506298740252